async function enviarScript() {
	const lines = [
		'Satanás',
		'⛥ Š̴̡̡̺͎̪ă̶̠̻̌̈́͘͝ţ̷̣̯̪̥͋̐́̿a̸͎͒̂̎̍̈n̶̤͓̭̍͗ą̴̟́͐̉̒s̴̝̖̾͊ ⛥',
		'B̤̦͖̟͕͇̩͈̩͕̘̑͌͌̐͌̅́̚ḛ̬̫̟̟̘̖͔̲͙̞̑͂̒͊̊̓͛̾̚ͅl̞̘̱͙̮̫͔̲̙̇̓́̔ͅͅz̯̬͔͎͙̟̜̗̜͋͌̈́́̇̓̈̆͊ͅe͉̜̮̐̽̌͂͛̏͂̆̾͐ͅb̤̩̜̭̬̯͔͈̙̯̒̊͊̓̇̓ụ̭̭͎͔̦̙̙͛̾̌̂ḃ̜͍̯̠̫̮̝͎̽͊͊̔̏̋ͅ',
		'L̶͔̠͙̠͇̠̲̬͙̗̤̗̱͙̯̫͑̃̅̔͑̈͒͆͑̿̅̔̓̎̓̌̑̔̓͗̾̐̌̚ú̸̙̞̯̩̣̙͍͚̗̥̝̪̬̰͉̔͆̌͊̿̓̓̒͗̂̀͂͋͑̚c̴̤͎̘̯͎̯̦̞̮̮͔̫̥̠̗̘̬̤̲͇̎̎͋͊̐̊̌̅͐̑̓̍͂̋̊͊̑̌̊̑̆i҈̝̙̥̥͙̯̱̥̳̝̞̳̟̗̳̞̪̭̞̎̑̔̽̊̑̿̐̌̾͐̊̍̚f̸͉͉͕͙̥͎̫͚̣͇̦̥̱̝̘̬͙̯̀́̽̌̿̐͂̂̒̇̂̈́͆͛̓̏͋̈͂̃̅ĕ̵̩̙̲̫̪̣̬̰͎̯̬͔̪̦͉͍͙͚̠̳̖͇̰̈́̋̾͌̀̄̈̎͒̆́͌̔̉̇͌́̚r̵̪͉̗̞̠͓͍̮̠̲̗̣̲͈̤̠̟̦̦̘̦͍͂͊́͐͛́͊͌͆̄̓̌',
		'ነቹ፱ ጮዐጮቹክፕዐ ጎዪል ርⶴቹፏልዪ, ክልዐ ልጋጎልክፕል ፕቹክፕልዪ ቻ፱ፏጎዪ, ህዐርቹ ጎዪል ነዐቻዪቹዪ የዐዪ ነቹ፱ነ ርዪጎጮቹነ.',
		'Y҈͕̪̥̬̞̭̙̙̮͈̥͇̬́̏̏̓̂͛̒͆͑̂͆̊͛̌́̃̃̚o̵̥̠̯̭̱͍͖̟͕̘̘̗̗͎̠̫͕̳̠̙̰͖͊̋̒̓́͑͗̂̆͛͒̉͆̇̌̍̂͆̈̅͑́͋ṵ̶͈͇͉͎̘̱͇̜̱͔̥̋͆̓̾͊̿̐̏̈͐̌̀̎̚ͅŕ̶̟̝̙̘͙̭̪̫̖̳̪̰͖̫̘̬̭̙̦̈́̎̔̉́́̑̄̏̅̀̐̈́̎̾͛͂͆̾̋̄̚ͅ t̴̞̞͓̮̭̖̤̮͖͙̤̖̖͖̮̾̾̏͌̋͂̓̐̐͒̍͂̔̂̈̾͑̑̌͆i̶̠̟̰̟̜̬̠͍̠̮͈̟͔͚͇̥̒̀͑̊͊̓͐̿̆͂́̔͌̍͋́̊̉̇͒̚ͅḿ̷͈͔̲̙̪͈͍̜͉̰̭̮̪͕͓͓̠̜̝͇̳̙̎̅͗͊͒̆̂̾͋́̈̾̓̑̑̒͛͌́̊͐ͅe҈͙̫͈̫̠̘͎͈̥͈͍͕̪́͒̍̂́̈́͛̈́͋̾̏̓̈́͊̏̈̿͗ w̵͕͓̬̥̤̲͚͈̬̜͉͓̪̭̘̦̜͓̜͉̰͛͋̉́̅̋̉̐̊̑̑̾͂͒͗͊̌̈́̍̔i҉̭̰͚̪̙̗̩̯̭̜͉̠̬̊̓̓͂̓̏̈̊͑̊̐́̑̉͐̑̋̎͌̊̄̏̌l̵̦͇͖̮͓̘͉̭͉͉̠͙͓̤͚̣͖̈̀͛̌̾̂̓̅̈́̓̔͋̐̎̀̾̅̊͑̉̍̒ͅl̴̲̖̗͙̜̭͕̰͕̘̰̟̳̜̰̱̗̟̱̱̰̜̣̪͊͛̀̉́̈́́̄͆̎̔͒͐͆̓̓͐̄̽̋̃͆͗̚ c҉̫̝̮͚̪͈͔̠̳̬͎̠̐̈́̅͛͋̏̊͆̌͛̓̆̇͒̿͊̃̏͑̄̚o҉͔̦̰͚̜͔̣̝̩̤̤͓͉͔̌͒̈́̈́͑̓͒̇̅͛̀͒̑̀̀̉͒̀̐̎̌̚m҉̥͉̜̥̜̖͙̩̠̬̖͓͍̞͍̦̪͔̘̘̪̬̜̈̉̊̈́͐̽͊̑̽̑͊͆͑̉̉͐̓͂́̄̓̐e̷͇̥̭͎̥̝̞̣̖̤͖̗͍̤͍͙̲̣͙̳̪̓̂̀̅́̈̇͑̓̎̽͆̀͑̒̀̑̔̅͒̃̚',
		'6̷͔̩͍̞͎̹̘̆ͣ̍̄ͯͮ7̧̛̙̘̭͉̰͍͕͓̙͚̻̠̜͕̗̘͕̽̂ͮͯ̆̓ͥ͊̎̀̒ͯ́̿̉̌̂ͭ̚͞ خ̷̷̛̲͉͇̘̩̣͔̭̖̟̤ͣͬ͊̃̍͂ͨͬ̃ͯ̒ͬ͜͡͠ن̸̵̶̸̷̛̛͈͚͓͚͕͕̯̾̃ͨͫ͆͒͒̇͛ͭ̅͘͘͘ف̷̢̨̫͇̘̫͕̱͍̲̮͙̤̞̽̌͒͆̿̐̊ͭ̔̚͜͡ͅس̼̜̐̈́ͧ̾̾ا̶̨͙͕̥͚͋ͪͤ͌͋ͫ̔ͫ_̸̡̞͎̟̝̘̻͉̳̩̩̻̤̤̋ͦ͑͐̿ͨ̾ͭ̽̈ͦͫ́̕͜͝ͅء̶̘͆͌ ل̷̧̛̖̲̖͋ͤͣͩͦ̍ل̛̝̦̭͖̲̬̙̹͓̟͖̮͍̲̻̝̲̺ͦ͆̆ͧ̑̀̀͐̾̐͋ͩ̃̒́ͭͭͮ̃̑͢͜͡ب̴̵̼̬̭̫̮̗͚̗̠̘̭̱̫̾̎͋ͭ̈͛̍̾̊ͧ̓ͨ́̈́̋ͤ̿̀ͫ͘ي̸̶̡͎̲̪̻̱͇̫̫̝̩̄ͥ̄͠ͅع̡̩̙͔̝̩͚̓̓̂̆'
	];
	let index = 0;
	main = document.querySelector("#main"),
		textarea = main.querySelector(`div[contenteditable="true"]`)

	if (!textarea) throw new Error("Não há uma conversa aberta")

	console.log(lines);
	while (true) {
		if (index > lines.length - 1) {
			index = 0;
		}
		console.log(lines[index])

		textarea.focus();
		document.execCommand('insertText', false, lines[index]);
		textarea.dispatchEvent(new Event('change', { bubbles: true }));

		setTimeout(() => {
			(main.querySelector(`[data-testid="send"]`) || main.querySelector(`[data-icon="send"]`)).click();
		}, 100);

		index++;
		if (index !== lines.length) await new Promise(resolve => setTimeout(resolve, 250));
	}

	return lines.length;
}


enviarScript();